/* eslint-disable no-console */
console.info(
  '🚀%c author: %c zs ❤ wx %c',
  'background:#00D1B2;border:1px solid #00D1B2; padding: 1px; border-radius: 2px 0 0 2px; color: #fff;',
  'border:1px solid #00D1B2; padding: 1px; border-radius: 0 2px 2px 0; color: #00D1B2;',
  'background:transparent'
);
console.info(
  '🚀%c name: %c PowerCloudCrm %c',
  'background:#00D1B2;border:1px solid #00D1B2; padding: 1px; border-radius: 2px 0 0 2px; color: #fff;',
  'border:1px solid #00D1B2; padding: 1px; border-radius: 0 2px 2px 0; color: #00D1B2;',
  'background:transparent'
);
console.info(
  '🚀%c version: %c 1.0.0 %c',
  'background:#00D1B2;border:1px solid #00D1B2; padding: 1px; border-radius: 2px 0 0 2px; color: #fff;',
  'border:1px solid #00D1B2; padding: 1px; border-radius: 0 2px 2px 0; color: #00D1B2;',
  'background:transparent'
);

if(import.meta.env.VITE_APP_ENV === 'development') {
  console.info(`
                                                                                                 
           ▒▒               ███████                  ░░░░░░░░░░░                    ░░░      
         ▒▒▒▒             ████████████             ░░░░░░░░░░░░░░░                ░░░░░      
       ▒▒▒▒▒▒            ████      ████           ░░░░░        ░░░░              ░░░░░░      
     ▒▒▒▒▒▒▒▒           ████         ███          ░░░░         ░░░░             ░░░ ░░░      
   ▒▒▒▒▒  ▒▒▒          ████           ███          ░░         ░░░░░           ░░░░  ░░░      
   ▒▒     ▒▒▒          ███            ███                    ░░░░░           ░░░░   ░░░      
          ▒▒▒          ███            ███                 ░░░░░░            ░░░░    ░░░      
          ▒▒▒          ███            ███               ░░░░░             ░░░░      ░░░      
          ▒▒▒          ███            ███             ░░░░░             ░░░░░░░░░░░░░░░░░░   
          ▒▒▒           ███         ████            ░░░░                            ░░░      
          ▒▒▒            ███       ████           ░░░░                              ░░░      
          ▒▒▒             ████████████           ░░░░░░░░░░░░░░░░░░                 ░░░      
          ▒▒                 ██████              ░░░░░░░░░░░░░░░░░░                 ░░       
                                                                                             
   ██░ ██ ▓█████  ██▓     ██▓     ▒█████        █     █░ ▒█████   ██▀███   ██▓    ▓█████▄    
  ▓██░ ██▒▓█   ▀ ▓██▒    ▓██▒    ▒██▒  ██▒     ▓█░ █ ░█░▒██▒  ██▒▓██ ▒ ██▒▓██▒    ▒██▀ ██▌   
  ▒██▀▀██░▒███   ▒██░    ▒██░    ▒██░  ██▒     ▒█░ █ ░█ ▒██░  ██▒▓██ ░▄█ ▒▒██░    ░██   █▌   
  ░▓█ ░██ ▒▓█  ▄ ▒██░    ▒██░    ▒██   ██░     ░█░ █ ░█ ▒██   ██░▒██▀▀█▄  ▒██░    ░▓█▄   ▌   
  ░▓█▒░██▓░▒████▒░██████▒░██████▒░ ████▓▒░     ░░██▒██▓ ░ ████▓▒░░██▓ ▒██▒░██████▒░▒████▓    
   ▒ ░░▒░▒░░ ▒░ ░░ ▒░▓  ░░ ▒░▓  ░░ ▒░▒░▒░      ░ ▓░▒ ▒  ░ ▒░▒░▒░ ░ ▒▓ ░▒▓░░ ▒░▓  ░ ▒▒▓  ▒    
   ▒ ░▒░ ░ ░ ░  ░░ ░ ▒  ░░ ░ ▒  ░  ░ ▒ ▒░        ▒ ░ ░    ░ ▒ ▒░   ░▒ ░ ▒░░ ░ ▒  ░ ░ ▒  ▒    
   ░  ░░ ░   ░     ░ ░     ░ ░   ░ ░ ░ ▒         ░   ░  ░ ░ ░ ▒    ░░   ░   ░ ░    ░ ░  ░    
   ░  ░  ░   ░  ░    ░  ░    ░  ░    ░ ░           ░        ░ ░     ░         ░  ░   ░       
                                                                                   ░         
                                                                                             
                                                                    --  nononobug     
  `);
} else {
  console.info(`%c
                       ___________    ____ 
                ______/   \\__//   \\__/____\\ 
              _/   \\_/  :           //____\\\\ 
             /|      :  :  ..      /        \\ 
            | |     ::     ::      \\        / 
            | |     :|     ||     \\ \\______/ 
            | |     ||     ||      |\\  /  | 
             \\|     ||     ||      |   / | \\ 
              |     ||     ||      |  / /_\\ \\ 
              | ___ || ___ ||      | /  /    \\ 
               \\_-_/  \\_-_/ | ____ |/__/      \\ 
                            _\\_--_/    \\      / 
                           /____             / 
                          /     \\           / 
                          \\______\\_________/ %c 抓紧给控制台关了！
`, 'color: red; font-weight: bold;', 'color: red; font-weight: bold;font-size: 28px');
}